package lesson3;

public class Main3 {
    /*
    1. Создайте класс исключения, который будет выбрасываться при делении на 0.
    Исключение должно отображать понятное для пользователя сообщение об ошибке.
    2. Создайте класс исключений, которое будет возникать при обращении к пустому элементу в массиве
    ссылочного типа. Исключение должно отображать понятное для пользователя сообщение об ошибке
    3. Создайте класс исключения, которое будет возникать при попытке открыть несуществующий файл.
    Исключение должно отображать понятное для пользователя сообщение об ошибке.
     */
    public static void main(String[] args) {
        try {
            System.out.println(divide(8, 0));
        } catch (ArithmeticException e){
            e.printStackTrace();
        }
    }

    static double divide(int a, int b) {
        if (b == 0) {
            throw new DivideByZeroException();
        }
        return a / b;
    }
}
